Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 222, 222, 32)      896       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 111, 111, 32)      0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 394272)            0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                25233472  
_________________________________________________________________
dense_16 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 33        
=================================================================
Total params: 25,236,481
Trainable params: 25,236,481
Non-trainable params: 0
_________________________________________________________________
