Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 220, 220, 32)      9248      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 218, 218, 32)      9248      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 109, 109, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 107, 107, 64)      18496     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 105, 105, 64)      36928     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 103, 103, 64)      36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 166464)            0         
_________________________________________________________________
dense (Dense)                (None, 64)                10653760  
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 33        
=================================================================
Total params: 10,767,617
Trainable params: 10,767,617
Non-trainable params: 0
_________________________________________________________________
