Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 222, 222, 8)       224       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 220, 220, 16)      1168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 218, 218, 32)      4640      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 216, 216, 64)      18496     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 108, 108, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 106, 106, 128)     73856     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 53, 53, 128)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 51, 51, 256)       295168    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 25, 25, 256)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 23, 23, 512)       1180160   
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 11, 11, 512)       0         
_________________________________________________________________
flatten (Flatten)            (None, 61952)             0         
_________________________________________________________________
dense (Dense)                (None, 64)                3964992   
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 33        
=================================================================
Total params: 5,540,817
Trainable params: 5,540,817
Non-trainable params: 0
_________________________________________________________________
