Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 220, 220, 32)      9248      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 218, 218, 32)      9248      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 109, 109, 32)      0         
_________________________________________________________________
flatten (Flatten)            (None, 380192)            0         
_________________________________________________________________
dense (Dense)                (None, 64)                24332352  
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 33        
=================================================================
Total params: 24,353,857
Trainable params: 24,353,857
Non-trainable params: 0
_________________________________________________________________
