Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 220, 220, 32)      9248      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 218, 218, 32)      9248      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 109, 109, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 107, 107, 64)      18496     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 105, 105, 64)      36928     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 103, 103, 64)      36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 49, 49, 128)       73856     
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 47, 47, 128)       147584    
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 45, 45, 128)       147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 22, 22, 128)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 20, 20, 256)       295168    
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 18, 18, 256)       590080    
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 16, 16, 256)       590080    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 16384)             0         
_________________________________________________________________
dense (Dense)                (None, 64)                1048640   
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 33        
=================================================================
Total params: 3,006,849
Trainable params: 3,006,849
Non-trainable params: 0
_________________________________________________________________
